#大多数年份有365天。然而，地球绕太阳公转所需的时间实际上比这稍长一些。因此，在某些年份中会增加2月29日这一天，以弥补这一差异。这样的年份被称为闰年。决定一年是否为闰年的规则如下：
#任何能被400整除的年份都是闰年。在剩下的年份中，任何能被100整除的年份都不是闰年。在剩下的年份中，任何能被4整除的年份都是闰年。其他年份都不是闰年。
#编写一个程序，读取用户输入的年份，并显示一条消息，表明它是不是闰年。
years = int(input("输入年份: "))

if years % 400 == 0:
    # 规则 1：能被 400 整除的，一定是闰年 (例如: 2000, 2400)
    print("是闰年")
elif years % 100 == 0:
    # 规则 2：如果不能被 400 整除，但能被 100 整除的，一定不是闰年 (例如: 1900, 2100)
    print("不是闰年")
elif years % 4 == 0:
    # 规则 3：如果不能被 100 整除 (当然也就没被 400 整除)，但能被 4 整除的，是闰年 (例如: 2024, 2028)
    print("是闰年")
else:
    # 规则 4：剩下的年份都不是闰年 (例如: 2023, 2025)
    print("不是闰年")
